Лабораторная работа №9
Тема Использование основных шаблонов
Цель
Задание: Используя основные шаблоны создайте функции по индивидуальному заданию. Можно использовать текстовые шаблоны для вывода данных из словаря или списка.
 
Задание 1. Напишите две функции S(r) и l(r), принимающие в качестве
аргумента радиус окружности и возвращающие площадь круга и длину этой
окружности соответственно. Затем напишите функцию krug(), которая спрашивает у пользователя радиус окружности, а затем при помощи функций S(r) и l(r) выводит на экран площадь круга и длину окружности, разделённые пробелом.
 Напишите функцию, которая будет принимать в качестве аргумента список чисел, и возвращать список, в котором оставлены только четные
числа больше 10. В программе обеспечить ввод списка с клавиатуры.
Задание 3. Даны два списка: первый содержит произвольный список целых
чисел, второй - три числа а, b, с. Напишите функцию, которая принимает их в
качестве аргументов, и выводит элементы, которые одновременно больше а,
меньше в и делятся на с без остатка, а все остальные элементы списка необходимо
просуммировать и вывести конечный результат.
